Revit 2024 API
Application.IsEnergyAnalysisEnabled Property
 Checks whether or not energy analysis is enabled, and enable or disable it.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsEnergyAnalysisEnabled { get; set; }
Visual Basic
Public Property IsEnergyAnalysisEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool IsEnergyAnalysisEnabled {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace